---
kind: type
id: T:Autodesk.Revit.DB.FindReferenceTarget
source: html/fbdbb834-08e1-98d8-f9dc-28a1c4068ab7.htm
---
# Autodesk.Revit.DB.FindReferenceTarget

The type of reference to find from a ReferenceIntersector.

## Syntax (C#)
```csharp
public enum FindReferenceTarget
```